{"POSTypes": ["வினைச்சொற்கள்(verbs)", "வினையுரிச்சொற்கள்(Adverbs)", "பெயர்ச்சொற்கள்(Nouns)", "பிரதிபெயர்களை(Pronouns)", "உரிச்சொற்கள்(Adjectives)", "முன்மொழிவுகள்(Prepositions)", "இணைப்புகள்(Conjunctions)", "இடைச் சொற்கள்(Interjections)"], "verb": {"definition": "சொல் (Verb) என்பது ஒரு பகுத்தறிவுக் கொள்கையை அடையும் பொதுவான சொற்கள். இது ஒரு செயல், நடத்தியவரையோ அல்லது அவர்கள் செய்த செயலையோ குறிப்பிடுகின்றது. சொல்லால் என்பது ஒரு செயல், நிகழ்வு, நிரல் அல்லது இயல்புகளைக் குறிப்பிடுகின்றது.உதாரணமாக, \"ஓடு\", \"படிக்க\", \"மாறு\" ஆகியவை சொற்கள் ஆகும். இவை மனிதர்களின் நடத்தும் செயல்களைக் குறிப்பிடுகின்றன. எனவே, ஒரு சொல்லுக்கு முன் நிகழ்ந்த தவறான செயல்கள் அல்லது நிகழ்ச்சிகளை ஆதரிக்காமல் பயன்படுத்தக்கவை அல்லது அதன் மூலதனத்தை இழந்து கொண்ட சொல்லுக்கும் பிறகு வினை சேர்க்கப்படும்.", "Types": ["நிகழ்ச்சி சொல் (Actionverbs)", "நிலை சொல் (Stativeverbs)", "நிகழ்வாக்கும் சொல் (Transitive verbs)", "நிகழ்ந்தால் விடாமல் நிகழும் சொல் (Intransitive verbs)", "இணைச்சிச் சொல் (Linking verbs)", "உதவி சொல் (Helping verbs)", "மாற்றச் சொல் (Modal verbs)", "வாதி சொல் (Regular verbs)", "வடிவச் சொல் (Irregular verbs)", "வாசிப்பு வாக்கியங்கள் (Phrasal verbs)", "வினைக்கட்டளைகள் (Infinitives)"], "Types Explaination": {"Actionverbs": "செயல் வினைச்சொற்கள், அவற்றின் பெயர் சொல்வது போல், செயல்களைக் குறிக்கப் பயன்படுத்தப்படுகின்றன. இவை உடல்கள் அல்லது பொருட்களால் செய்யப்படும் உடல் ரீதியான செயல்களைக் குறிக்கலாம், அதாவது குதித்தல், அடித்தல் அல்லது பாடுதல், அல்லது சிந்திக்க, கருத்தில் கொள்ளுதல் அல்லது மனப்பாடம் செய்ய நாம் மூளையைப் பயன்படுத்தும் மனச் செயல்கள். நீங்கள் காணக்கூடிய பெரும்பாலான வினைச்சொற்கள் செயல் வினைச்சொற்கள்", "Stativeverbs": "செயல் வினைச்சொற்களைப் போலன்றி, நிலையான வினைச்சொற்கள் நிலைமைகள் அல்லது நிலைகளைக் குறிக்கின்றன. பொதுவாக, குணங்கள், இருப்பு நிலைகள், கருத்துகள், நம்பிக்கைகள் மற்றும் உணர்ச்சிகள் போன்ற விஷயங்களை விவரிக்க நிலையான வினைச்சொற்களைப் பயன்படுத்துகிறோம். ஒரு வாக்கியத்தில் பயன்படுத்தப்படும் போது, நிலையான வினைச்சொற்கள் செயல்களைக் குறிக்காது. சில வினைச்சொற்கள் வாக்கியத்தில் அவற்றின் பொருளைப் பொறுத்து செயல் அல்லது நிலையான வினைச்சொற்களாகப் பயன்படுத்தப்படலாம் என்பதை அறிவது முக்கியம். தொடர்ச்சியான வினைச்சொற்களில் நிலையான வினைச்சொற்களைப் பயன்படுத்துவது குறைவு", "Transitiveverbs": "ஒரு இடைநிலை வினைச்சொல் என்பது ஒரு வாக்கியத்தில் நேரடி பொருளுடன் இருக்கும் ஒரு வினைச்சொல். நேரடி பொருள் என்பது பெயர்ச்சொல், பிரதிபெயர் அல்லது பெயர்ச்சொல் சொற்றொடர் ஆகும், இது வாக்கியத்தின் பொருளால் ஏதாவது செய்யப்படுகிறது. செயல் மற்றும் நிலையான வினைச்சொற்கள் இரண்டும் நேரடி பொருள்களைக் கொண்டிருக்கலாம், அதாவது அவை இரண்டும் இடைநிலை வினைச்சொற்களாகப் பயன்படுத்தப்படலாம்", "Intransitiveverbs": "ஒரு இடைநிலை வினைச்சொல்லின் எதிர்ச்சொல் ஒரு மாறாத வினைச்சொல். ஒரு வினைச்சொல் ஒரு நேரடியான பொருளுடன் பயன்படுத்தப்படாவிட்டால், ஒரு வினைச்சொல்லாகும். நினைவில் கொள்ளுங்கள், பெயர்ச்சொற்கள், பிரதிபெயர்கள் மற்றும் பெயர்ச்சொல் சொற்றொடர்கள் மட்டுமே நேரடி பொருள்களாக இருக்க முடியும். முன்மொழிவு சொற்றொடர்கள், உரிச்சொற்கள் மற்றும் வினையுரிச்சொற்களை நேரடி பொருள்களாகப் பயன்படுத்த முடியாது. மீண்டும் ஒருமுறை, செயல் மற்றும் நிலையான வினைச்சொற்கள் இரண்டையும் இடைநிலை வினைச்சொற்களாகப் பயன்படுத்தலாம்", "Linkingverbs": "இணைக்கும் வினைச்சொற்கள் ஒரு சிறப்பு வகை நிலையான வினைச்சொல் ஆகும், அதன் பெயர் அவர்கள் என்ன செய்கிறார்கள் என்பதற்கான பெரிய குறிப்பை அளிக்கிறது. இணைக்கும் வினைச்சொற்கள் ஒரு விஷயத்தை ஒரு பொருள் நிரப்புதலுடன் இணைக்கப் பயன்படுகின்றன. ஒரு பொருள் நிரப்பு வாக்கியம் அல்லது உட்பிரிவின் விஷயத்தை விவரிக்கிறது அல்லது அடையாளம் காட்டுகிறது. இணைக்கும் வினைச்சொற்கள் நேரடியான பொருள்களை எடுத்துக் கொள்ளாத, மாறாத வினைச்சொற்களாக செயல்படும்", "Helpingverbs": "உதவி வினைச்சொற்கள், துணை வினைச்சொற்கள் என்றும் அழைக்கப்படுகின்றன, அவை ஒரு வாக்கியத்தின் அர்த்தத்தை மாற்ற மற்ற வினைச்சொற்களுடன் வேலை செய்யும் பயனுள்ள வினைச்சொற்கள். ஒரு உதவி வினைச்சொல் வெவ்வேறு இலக்குகளை அடைவதற்காக ஒரு முக்கிய வினைச்சொல்லுடன் இணைகிறது. வினைச்சொல்லின் காலத்தை மாற்றுவது அல்லது ஒரு வாக்கியத்தின் மனநிலையை மாற்றுவது ஆகியவை இதில் அடங்கும்", "Modalverbs": "மாதிரி வினைச்சொற்கள் என்பது ஒரு வாக்கியத்திற்கு ஒரு குறிப்பிட்ட மனநிலையை வழங்க பயன்படும் உதவி வினைச்சொற்களின் துணைக்குழு ஆகும். ஒவ்வொரு மாதிரி வினைச்சொல்லும் வித்தியாசமாகப் பயன்படுத்தப்படுகிறது, மேலும் அவை திறன், தேவை, சாத்தியம் அல்லது அனுமதி போன்ற கருத்துக்களை வெளிப்படுத்தலாம்", "Regularverbs": "ஒரு வினைச்சொல் அதன் கடந்த கால வடிவம் மற்றும் கடந்த பங்கேற்பு -ed, -d இல் முடிவடைந்தால், அது வழக்கமான வினைச்சொல்லாகக் கருதப்படுகிறது அல்லது வினைச்சொல் -t மாறுபாடு வினைச்சொல். எடுத்துக்காட்டாக, வினை தோற்றம் என்பது வழக்கமான வினைச்சொல் ஆகும், ஏனெனில் அதன் கடந்த கால வடிவம் மற்றும் கடந்த பங்கேற்பு இரண்டும் பார்க்கப்படுகின்றன. சில நேரங்களில், வழக்கமான வினைச்சொற்கள் எழுத்துப்பிழைகளை சிறிது மாற்றலாம். எடுத்துக்காட்டாக, அழுகையின் கடந்த காலம் மற்றும் கடந்த பங்கேற்பு ஆகியவை அழுதன", "Irregularverbs": "ஒழுங்கற்ற வினைச்சொல் என்பது ஒரு வினைச்சொல் ஆகும், அதன் கடந்த காலம் மற்றும் கடந்த பங்கேற்பு வடிவம் -ed, -d இல் முடிவடையாது மற்றும் -t மாறுபாட்டைப் பயன்படுத்தாது. பெரும்பாலும், இந்த வினைச்சொற்களின் எழுத்துப்பிழை வியத்தகு முறையில் மாறுகிறது அல்லது மாறாமல் இருக்கலாம்", "Phrasalverbs": "ஃப்ரேசல் வினைச்சொற்கள் என்பது முன்மொழிவுகள் மற்றும்/அல்லது வினையுரிச்சொற்கள் கொண்ட வினைச்சொல்லின் கலவையாகும், அவை அவற்றை உருவாக்கப் பயன்படுத்தப்படும் தனிப்பட்ட சொற்களிலிருந்து வேறுபட்ட பொருளைக் கொண்டுள்ளன. எடுத்துக்காட்டாக, shut என்ற வினைச்சொல் \"மூடு\" என்று பொருள்படும், மேலும் கீழுள்ள வினையுரிச்சொல் \"மேலே இல்லை\" அல்லது \"இறங்கும் திசையில்\" என்று பொருள்படும். இருப்பினும், ஷட் டவுன் என்ற வாக்கிய வினைச்சொல் எதையாவது செயல்படுவதை நிறுத்துவதாகும்", "Infinitivesverbs": "எங்கள் கடைசி வகை வினைச்சொல் உண்மையில் ஒரு வினைச்சொல் அல்ல - அதற்காக மன்னிக்கவும்! இருப்பினும், முடிவிலிகள் வினைச்சொற்களைப் போலவே இருக்கின்றன, ஏனெனில் அவை அவற்றிலிருந்து பெறப்பட்டவை. ஒரு வினைச்சொல்லின் முடிவிலியானது வினைச்சொல்லின் அடிப்படை வடிவத்திற்கு ஒத்ததாகும். எடுத்துக்காட்டாக, திறந்த வினைச்சொல்லின் முடிவிலி வடிவம் திறந்தது. பொதுவாக, infinitive சொற்றொடர்களை உருவாக்க, to என்ற வார்த்தையுடன் infinitives ஐப் பயன்படுத்துகிறோம். பெயர்ச்சொற்கள், உரிச்சொற்கள் அல்லது வினையுரிச்சொற்கள் போன்ற பல்வேறு காரணங்களுக்காக முடிவிலி சொற்றொடர்கள் பயன்படுத்தப்படலாம்."}, "example": {"Actionverbs": ["1.நான் ஒரு தொழிற்சாலையில் வேலை செய்கிறேன்", "2.பூனைகள் எலிகளைத் துரத்துகின்றன", "3.அந்தப் பெண்ணின் அற்புதமான கதையைக் கேட்டோம்"], "Stativeverbs": ["இந்த மாளிகையில் ஐந்து குளியலறைகள் உள்ளன", "அல்லி தன் தங்கைகளை நேசிக்கிறாள்\nஎனது காருக்கு எண்ணெய் மாற்ற வேண்டும்"], "Transitiveverbs": ["லியோனார்டோ ஒரு சுவையான பெப்பரோனி பீட்சாவை சாப்பிட்டார்", "பணக்காரர் மூன்று ஓவியங்களை வாங்கினார்", "அவள் உண்மையில் ப்ரோக்கோலியை வெறுக்கிறாள்."], "Intransitiveverbs": ["விமானங்கள் பறக்கின்றன.", "பெரியவர்கள் வேலை செய்யும் போது குழந்தைகள் தூங்கினர்.", "பசியுடன் இருந்த ராட்சத பாம்பைக் கண்டு பயந்துபோன குரங்குகள்"], "Linkingverbs": ["மைக் ஒரு சிறந்த நடனக் கலைஞர்.", "அந்த தங்க கடிகாரம் விலை உயர்ந்ததாக தெரிகிறது", "திடீரென மாலில் கூட்டம் அலைமோதியது"], "Helpingverbs": ["இசைக்கலைஞர் உலகம் முழுவதும் கச்சேரிகளில் பங்கேற்றார்.", "என் பூனை வயதான காலத்தில் மெதுவாக வருகிறது", "சிறுத்தைகள் நம்பமுடியாத வேகத்தில் ஓடக்கூடியவை"], "Modalverbs": ["உங்கள் வீட்டுப்பாடம் முடிந்ததும், நீங்கள் வெளியே விளையாடலாம்", "கலவை கிண்ணத்தில் நாம் கவனமாக இரண்டு முட்டைகளை சேர்க்க வேண்டும்", "நான் வேலையில் பிஸியாக இல்லாவிட்டால் திரைப்படங்களுக்கு செல்வேன்"], "Regularverbs": ["தபால் நிலையத்திற்கு இரண்டு மைல் நடந்தான்", "முகாம் பயணத்திற்கு தேவையான அனைத்து பொருட்களையும் வாங்கினோம்", "மார்கஸின் கதையில் விசித்திரமான ஒன்றை டிஃப்பனி கவனித்திருந்தார்"], "Irregularverbs": ["சிண்டி சரியான பதில்கள் அனைத்தையும் அறிந்திருந்தார்.", "இந்த ஜங்கி கம்ப்யூட்டர் வாங்கியதில் இருந்து எனக்கு தலைவலியைத் தவிர வேறெதையும் கொடுக்கவில்லை", "ஓடும் லாரியில் இருந்த தளபாடங்களை தொழிலாளர்கள் வெளியே எடுத்தனர்"], "Phrasalverbs": ["விரக்தியடைந்த வணிக உரிமையாளர் தனது கடையை மூடிவிட்டார்", "டேவ் தனது பேஸ்பால் கோப்பைகளைக் காட்ட விரும்புகிறார்", "அவசர காலங்களில் கொஞ்சம் பணத்தை ஒதுக்கி வைப்பது நல்லது என்று என் அம்மா என்னிடம் எப்போதும் சொல்வார்கள்"], "Infinitivesverbs": ["ராக் இசைக்குழுவில் கிட்டார் வாசிப்பதே எனது குறிக்கோள்", "நீங்கள் நகரத்தில் சிறந்த உணவகங்களைத் தேடுகிறீர்களானால், லூயிஸ் கேட்க வேண்டிய நபர்", "கடிதத்தில் உள்ள எழுத்து பார்ப்பதற்கு மிகவும் சிறியதாக இருந்தது"]}}, "Adverb": {"definition": "வினையுரிச்சொல் என்பது ஒரு வினைச்சொல், பெயரடை, மற்றொரு வினையுரிச்சொல் அல்லது முழு வாக்கியத்தை மாற்றியமைக்க அல்லது விவரிக்கக்கூடிய ஒரு சொல். வினையுரிச்சொற்கள் முறை (எப்படி ஏதாவது நடக்கிறது), பட்டம் (எந்த அளவிற்கு), இடம் (எங்கே), மற்றும் நேரம் (எப்போது) ஆகியவற்றைக் காட்ட பயன்படுத்தலாம்.வினையுரிச்சொற்கள் பொதுவாக ஒரு பெயரடையின் முடிவில் -ly சேர்ப்பதன் மூலம் உருவாக்கப்படுகின்றன (எ.கா., \"விரைவு\" என்பது \"விரைவாக\" மாறும்), இருப்பினும் இந்த முடிவு இல்லாத பிற வினையுரிச்சொற்களும் உள்ளன. வினையுரிச்சொற்கள், வினையுரிச்சொற்களின் இலக்கணப் பாத்திரத்தை வகிக்கும் சொற்களின் தொடர்களும் உள்ளன", "Types": ["மாதிரி வினையெச்சங்கள்(Adverbs of manner )", "இட வினையெச்சங்கள்(Adverbs of place)", "கால வினையெச்சங்கள்(Adverbs of time)", "நடப்புத்தன்மை வினையெச்சங்கள்(Adverbs of frequency)", "அளவு வினையெச்சங்கள்(Adverbs of degree)"], "Types Explaination": {"Adverbs of manner": "வினையுரிச்சொற்கள் ஒரு வாக்கியத்தில் பாடத்தால் செய்யப்படும் செயலைப் பற்றிய கூடுதல் தகவல்களை வாசகர் அல்லது கேட்பவருக்கு வழங்க வாக்கியங்களில் பயன்படுத்தப்படுகின்றன. 'எப்படி' என்ற கேள்வியைக் கேட்பதன் மூலம் இது பொதுவாக அடையாளம் காணப்படுகிறது", "Adverbs of Place": "ஒரு செயல் நடைபெறும் இடம் அல்லது இடத்தை விவரிக்க ஒரு வாக்கியத்தில் பயன்படுத்தப்படும் வினையுரிச்சொற்கள் இடத்தின் வினையுரிச்சொற்கள் என்று அழைக்கப்படுகின்றன. 'எங்கே' என்ற கேள்விக்கு அவர்கள் பதிலளிக்கிறார்கள். அவை பெரும்பாலும் முக்கிய வினைச்சொல் அல்லது ஒரு வாக்கியத்தில் உள்ள பொருளுக்குப் பிறகு காணப்படுகின்றன. அவை தூரம் அல்லது ஒரு குறிப்பிட்ட திசையில் ஒரு பொருளின் இயக்கத்தையும் குறிக்கலாம்.", "Adverbs of Time": "காலத்தின் வினையுரிச்சொல், பெயர் குறிப்பிடுவது போல, வாக்கியத்தில் குறிப்பிடப்பட்டுள்ள ஒரு செயலின் போது சித்தரிக்க ஒரு வாக்கியத்தில் பயன்படுத்தலாம். 'எப்போது' என்ற கேள்வியைக் கேட்பதன் மூலம் அதை அடையாளம் காணலாம். ஒரு வாக்கியத்தின் முடிவில் வைக்கப்படும் போது அவை சிறப்பாகச் செயல்படுகின்றன, ஆனால் முக்கியத்துவம் கொடுக்க வினையுரிச்சொல்லின் நிலையை மாற்றலாம்", "Adverbs of Frequency": "அதிர்வெண் வினையுரிச்சொல் என்பது வினைச்சொல், பெயரடை அல்லது மற்றொரு வினையுரிச்சொல் பற்றிய கூடுதல் தகவல்களை வழங்க ஒரு வாக்கியத்தில் பயன்படுத்தப்படும் ஒரு சொல். அதிர்வெண்ணின் வினையுரிச்சொற்களை பொருளாகச் செயல்படும் பெயர்ச்சொல் அல்லது பிரதிபெயருக்குப் பிறகும், ஒரு வாக்கியத்தில் ஒரு வினைச்சொல் இருந்தால் வினைச்சொல்லுக்கு முன்பும் வைக்கலாம். ஒரு வாக்கியத்தில் ஒன்றுக்கு மேற்பட்ட வினைச்சொற்கள் இருந்தால் (எ.கா., துணை வினை), அதிர்வெண்ணின் வினையுரிச்சொல் முக்கிய வினைச்சொல்லுக்கு முன் வைக்கப்படும்", "Adverbs of Degree": "ஒரு வினைச்சொல், வினைச்சொல் அல்லது மற்றொரு வினையுரிச்சொல்லின் தீவிரம் அல்லது பட்டத்தை சித்தரிக்க ஒரு வாக்கியத்தில் பட்டத்தின் வினையுரிச்சொல் பயன்படுத்தப்படுகிறது. இது பொதுவாக 'எந்த அளவிற்கு' என்ற கேள்விக்கு பதிலளிக்கிறது. அவை பொதுவாக அவை மாற்றியமைக்கும் வார்த்தையின் முன் நிலைநிறுத்தப்படுகின்றன (பெரும்பாலான சந்தர்ப்பங்களில் ஒரு பெயரடை)."}, "example": {"Adverbs of manner": ["தீபிகா தனது மகனால் ஏற்பட்ட சேதத்திற்கு ஆழ்ந்த வருத்தம் தெரிவித்தார்", "செமஸ்டர் தேர்வு முடிவுகளுக்காக ஆவலுடன் காத்திருந்தனர்", "மோனிகாவும் ரேச்சலும் ஃபோபியின் துணைத்தலைவர்களாக இருக்க மகிழ்ச்சியுடன் ஒப்புக்கொண்டனர்"], "Adverbs of Place": ["சிறுவன் கோப்பைகளை இங்கே வைத்திருக்கும்படி கேட்டான்", "நீங்கள் இன்று வெளியே செல்கிறீர்களா?", "நாற்காலியை வெளியில் விட்டுவிடுவீர்களா?"], "Adverbs of Time": ["நான் நாளை என் உறவினர் வீட்டிற்கு செல்கிறேன்.", "நேற்று டீனா, அனுவை சூப்பர் மார்க்கெட்டில் சந்தித்தார்.", "தயவு செய்து நகல்களை விரைவில் கொண்டு வர முடியுமா, அதனால் நாங்கள் மாணவர்களுக்கு வழங்க முடியுமா?"], "Adverbs of Frequency": ["ஆஷிஷ் அடிக்கடி ஹோட்டல்களில் இருந்து உணவு சாப்பிட விரும்புகிறார்", "வில்லி எப்போதும் பல்பொருள் அங்காடியில் இருந்து மளிகைப் பொருட்களை வாங்குவார்.", "ஆசிரியர்கள் ஒவ்வொரு மணி நேரமும் வருகை தர அறிவுறுத்தப்பட்டுள்ளது"], "Adverbs of Degree": ["மிக்கி மிகவும் உயரமானவர்", "நாங்கள் வைத்திருந்த மோர் மிகவும் குளிராக இருந்தது", "ஆண்டின் இந்த நேரத்தில் மிகவும் குளிராக இருக்கிறது"]}}, "Noun": {"definition": "பெயர்ச்சொற்கள் மக்கள், இடங்கள், விலங்குகள், பொருள்கள் மற்றும் யோசனைகளை பெயரிட பயன்படுத்தப்படும் வார்த்தைகளை உள்ளடக்கிய பேச்சின் ஒரு பகுதியாகும். ஏறக்குறைய ஒவ்வொரு வாக்கியமும் நிச்சயமாக ஒரு பெயர்ச்சொல்லைக் கொண்டிருக்கும், மேலும் அவை ஒரு வாக்கியத்தில் வெவ்வேறு பாத்திரங்களைச் செய்கின்றன. பெயர்ச்சொற்கள் பொருள், ஒரு மறைமுக பொருள், ஒரு நேரடி பொருள், ஒரு பொருள் நிரப்பு மற்றும் ஒரு பொருள் நிரப்பியாக செயல்பட முடியும். பெயர்ச்சொற்கள் உரிச்சொற்கள் மற்றும் வினைச்சொற்களாகவும் செயல்படலாம்", "Types": ["சரியான பெயர்ச்சொற்கள்(Proper Nouns)", "பொதுவான பெயர்ச்சொற்கள்(Common nouns)", "ஒருமை பெயர்ச்சொற்கள்(Singular nouns)", "பன்மை பெயர்ச்சொல்(Plural nouns)", "எண்ணக்கூடிய பெயர்ச்சொற்கள்(Countable nouns)", "கணக்கிட முடியாத(Uncountable nouns)", "கூட்டு பெயர்ச்சொற்கள்(Collective Nouns)", "கான்கிரீட் பெயர்ச்சொற்கள்(Concrete Nouns)", "சுருக்க பெயர்ச்சொற்கள்( Abstract Nouns)"], "Types Explaination": {"Proper Noun": "ஒரு சரியான பெயர்ச்சொல் என்பது ஒரு குறிப்பிட்ட நபர், இடம், நாட்கள், மாதங்கள், மொழிகள், தேசியங்கள், வரலாற்று முக்கியத்துவம் வாய்ந்த நிகழ்வுகள், குறிப்பிடத்தக்க காலங்கள் மற்றும் காலங்கள் மற்றும் குறிப்பிட்ட பிராண்டுகளை பெயரிட பயன்படும் பெயர்ச்சொல் ஆகும்", "Common Noun": "மெரியம்-வெப்ஸ்டர் அகராதியின்படி, பொதுவான பெயர்ச்சொல்லின் வரையறை, 'ஒரு அல்லது ஒரு, சில, ஒவ்வொரு, மற்றும் என் போன்றவை) கட்டுப்படுத்தும் மாற்றியமைப்புடன் நிகழக்கூடிய ஒரு பெயர்ச்சொல் மற்றும் இது ஒரு வகை உயிரினங்களில் ஏதேனும் ஒன்றைக் குறிக்கும் அல்லது விஷயங்கள்'. கேம்பிரிட்ஜ் அகராதியின்படி, ஒரு பொதுவான பெயர்ச்சொல் என்பது \"அட்டவணை\" அல்லது \"புத்தகம்\" போன்ற ஒத்த விஷயங்களின் குழுவின் பெயர், ஒரு நபர், இடம் அல்லது பொருளின் பெயர் அல்ல' என வரையறுக்கப்படுகிறது.", "Singular Noun": "ஒரு ஒற்றை பெயர்ச்சொல்லின் வரையறை பொதுவாக ஒரு பெயர்ச்சொல்லின் வரையறைக்கு ஒத்ததாகும். கேம்பிரிட்ஜ் அகராதியின்படி, ஒருமை பெயர்ச்சொல் என்பது 'ஒரு நபர், இடம், பொருள், நிகழ்வு, பொருள் அல்லது தரத்தைக் குறிக்கும் சொல்.' 'பெயர்ச்சொல் என்பது 'கார்', 'காதல்' அல்லது 'அன்னே' போன்ற ஒரு வார்த்தையாகும். 'இது ஒரு நபர் அல்லது பொருளைக் குறிக்கப் பயன்படுகிறது' என காலின்ஸ் அகராதி கூறுகிறது", "Plural Noun": "பன்மை என்ற சொல் 'ஒன்றுக்கு மேற்பட்ட அல்லது சில மொழிகளில் இரண்டிற்கும் மேற்பட்டவற்றைக் குறிக்க பொதுவாகப் பயன்படுத்தப்படும் இலக்கண வடிவங்களின் வகுப்போடு தொடர்புடையது அல்லது அமைப்பது' மற்றும் 'ஒன்று அல்லது அதற்கு மேற்பட்ட வகைகளுடன் தொடர்புடையது, உள்ளடக்கியது அல்லது உள்ளடக்கியது வகுப்பு', மெரியம்-வெப்ஸ்டர் அகராதியின் படி. எனவே ஒன்றுக்கு மேற்பட்ட நபர்கள், இடம் அல்லது பொருள்களை உள்ளடக்கிய அல்லது தொடர்புடைய ஒரு பெயர்ச்சொல் பன்மை பெயர்ச்சொல்லாக வரையறுக்கப்படுகிறது.", "Countable Noun": "கணக்கிடக்கூடிய பெயர்ச்சொல், பெயர் குறிப்பிடுவது போல, உண்மையில் கணக்கிடக்கூடிய பெயர்ச்சொற்களைக் குறிக்கிறது. எண்ணக்கூடிய பெயர்ச்சொற்களின் எண்ணிக்கை அல்லது அளவை சரியாகக் குறிப்பிடலாம். ஒரு பெயர்ச்சொல் கணக்கிடக்கூடியதா என்பதை அடையாளம் காண, நீங்கள் 'எத்தனை' என்ற கேள்வியைக் கேட்கலாம். கேம்பிரிட்ஜ் அகராதியின்படி, கணக்கிடக்கூடிய பெயர்ச்சொல், \"ஒருமை மற்றும் பன்மை இரண்டையும் கொண்ட ஒரு பெயர்ச்சொல்லாகவும், அதில் ஒன்று அல்லது அதற்கு மேற்பட்டவை இருக்கலாம் என்பதால் எண்ணக்கூடிய ஒன்றை பெயரிடுகிறது\" என வரையறுக்கப்படுகிறது. மேக்மில்லன் அகராதி கணக்கிடக்கூடிய பெயர்ச்சொல்லை \"ஒருமை மற்றும் பன்மை வடிவங்களைக் கொண்ட ஒரு பெயர்ச்சொல்\" என வரையறுக்கிறது. பன்மையில், கணக்கிடக்கூடிய பெயர்ச்சொற்கள் பொதுவாக 's' அல்லது 'es' ஐ சேர்க்கும், எடுத்துக்காட்டாக 'தவறுகள்', 'சிக்கல்கள்' மற்றும் 'பஸ்கள்'. இது ஒருமையாக இருக்கும்போது, கணக்கிடக்கூடிய பெயர்ச்சொல் பொதுவாக 'a', 'இது', 'ஏதேனும்' அல்லது 'நிறைய' போன்ற ஒரு தீர்மானிக்குப் பிறகு வரும், எடுத்துக்காட்டாக, 'இந்த வீடு, 'ஒரு வாரம்' மற்றும் 'வழி", "Uncountable Noun": "கணக்கிடுப் பெயர்ச்சொற்கள் என்பன எண்ணிக்கையால் எண்ணி கணக்கிடக்கூடிய சொற்கள் ஆகும். அதாவது ஒன்று, இரண்டு, மூன்று என எண்ணி கணக்கிடக்கூடிய சொற்கள் எல்லாம் கணக்கிடுப் பெயர்ச்சொற்கள் தான்.\",\"Uncountable Nouns\":\"கணக்கிடக்கூடிய பெயர்ச்சொற்களைப் போலன்றி, கணக்கிட முடியாத பெயர்ச்சொற்கள் தனித்தனி கூறுகளாக பிரிக்க முடியாத பொருட்கள், கருத்துகள் போன்றவை. நாம் அவர்களை \"எண்ண\" முடியாது. உதாரணமாக, நாம் \"பால்\" கணக்கிட முடியாது. நாம் \"பால் பாட்டில்கள்\" அல்லது \"லிட்டர் பால்\" என்று எண்ணலாம், ஆனால் \"பால்\" தானே கணக்கிட முடியாது. இன்னும் சில கணக்கிட முடியாத பெயர்ச்சொற்கள் இங்கே:", "Collective Noun": "கூட்டு பெயர்ச்சொல் என்பது ஒரு குழு அல்லது விலங்குகள், மக்கள் அல்லது பொருட்களின் எண்ணிக்கையைக் குறிக்கப் பயன்படுத்தப்படும் பெயரிடும் சொல். வாக்கியங்களில் கூட்டுப் பெயர்ச்சொற்களைப் பயன்படுத்தும்போது நீங்கள் நினைவில் கொள்ள வேண்டிய ஒன்று, வினைச்சொல்லின் சரியான வடிவத்தைப் பயன்படுத்துவது", "Concrete Noun": "கண்ணால் பார்க்கவும், கையால் தொடவும் கூடியவற்றை \"திடப் பெயர்சொற்கள்\" எனலாம். இவை பொதுவானப் பெயர்சொற்களாகவோ உரித்தானப் பெயர்சொற்களாகவோ இருக்கலாம். கணகிடுப் பெயர்சொற்களாகவோ கணக்கிடமுடியாப் பெயர்சொற்களாகவோ இருக்கலாம்.", "Abstract Noun": "ஒரு சுருக்க பெயர்ச்சொல் கருத்துக்கள், யோசனைகள், அனுபவங்கள், குணாதிசயங்கள், உணர்வுகள் அல்லது பொருள்களைக் குறிக்கப் பயன்படுகிறது, அவை பார்க்கவோ, கேட்கவோ, சுவைக்கவோ, உணரவோ அல்லது தொடவோ முடியாது. சுருக்கமான பெயர்ச்சொற்கள் உறுதியானவை அல்லது உறுதியானவை அல்ல. பழமொழிகளில் நிறைய சுருக்க பெயர்ச்சொற்கள் (நற்குணங்கள்) பயன்படுத்தப்படுகின்றன."}, "example": {"Proper Noun": ["என் பெயர் ரோஸ். (குறிப்பிட்ட நபரின் பெயர்)", "இது என் நாய், புருனோ. (ஒருவருக்குச் சொந்தமான குறிப்பிட்ட செல்லப் பிராணியின் பெயர்)", "டேவிட் மின்ஸ்கிலிருந்து திரும்பி வந்தார். (குறிப்பிட்ட இடத்தின் பெயர்)"], "Common Noun": ["நேற்று பேனா வாங்கினேன். (பொதுவான பொருள்)", "நான் பள்ளிக்கு செல்கிறேன். (பொது இடம்)", "பத்து ஊழியர்கள் மட்டுமே இன்று பணிக்கு வந்தனர். (பொதுவான குழு)"], "Singular Noun": ["எங்கள் வீட்டுக்கு முன்னால் ஒரு சிறுவன் இருக்கிறான். (தனி நபர்)", "அது என் மகள். (தனி நபர்)", "புதரில் காயப்பட்ட குருவியைக் கண்டேன். (ஒற்றை பறவை)"], "Plural Noun": ["எனக்கு சில ஆப்பிள்கள் வேண்டும்.", "நீங்கள் தேடும் பெட்டிகள் கிடைத்ததா?", "நான் சந்தையில் இருந்து மாம்பழங்களை வாங்கினேன்"], "Countable Noun": ["டாம் பயணத்திற்காக பத்து பாக்கெட்டுகளை கொண்டு வந்தார். (குறிப்பிட்ட எண் - பத்து)", "அம்மா என்னிடம் ஒரு டஜன் முட்டைகளை வாங்கச் சொன்னார். (குறிப்பிட்டது - டஜன் என்றால் பன்னிரண்டு)", "காலை ஏழு மணியளவில் ஒரு விமானத்தைப் பார்த்தேன். (குறிப்பிட்டது - ஒரு பொருள்)"], "Uncountable Noun": ["எனக்கு நிறைய வீட்டு வேலைகள் உள்ளன. (குறிப்பிடப்படவில்லை)", "என்னிடம் ஒரு கோப்பை தேநீர் உள்ளது. (எண்ண முடியாது)", "நாம் இன்று பயங்கரமான காலநிலையை எதிர்கொண்டுள்ளோம். (எண்ண முடியாது)"], "Collective Noun": ["சிங்கங்களின் பெருமை", "இசைக்கலைஞர்களின் குழு", "ஒரு ஜோடி காலணிகள்"], "Concrete Noun": ["நூல் மேசையின் மீது உள்ளது.", "நான் ஒரு கோப்பை காபி சாப்பிட்டேன்.", "ஷரோன் ஜன்னல்களைத் திறந்தான்."], "Abstract Noun": ["காதல் ஒரு வலுவான உணர்ச்சி", "நேர்மையே சிறந்த கொள்கை.", "நேர்மையே சிறந்த கொள்கை."]}}, "Pronouns": {"definition": "உறவினர் பிரதிபெயர் என்பது ஒரு சார்புடைய உட்பிரிவுடன் ஒரு சுயாதீன உட்பிரிவை இணைக்கப் பயன்படும் ஒரு சொல். உறவினர் பிரதிபெயர்கள் என்பது அது தொடர்புடைய பொருள் (பெயர்ச்சொல் அல்லது பிரதிபெயர்) பற்றிய கூடுதல் தகவல்களை வழங்குவதாகும். இந்த தொடர்புடைய பிரதிபெயர்கள் உரிச்சொற்களைப் போலவே செயல்படுகின்றன, எனவே அவை உருவாக்கும் உட்பிரிவுகளை பெயரடை உட்பிரிவுகள் என்றும் அழைக்கலாம்", "Types": ["உறவினர் பிரதிபெயர்கள் (Relative Pronouns)", "உடைமை பிரதிபெயர்கள் (Possessive Pronouns)", "பிரதி பெயர்ச்சொற்கள்(Reflexive Pronouns)", "ஆர்ப்பாட்ட பிரதிபெயர்கள்(Demonstrative Pronouns)", "கேள்விக்குரிய பிரதிபெயர்கள்(Interrogative Pronouns)", "காலவரையற்ற பிரதிபெயர்களை(Indefinite Pronouns)", "தனிப்பட்ட பிரதிபெயர்களை(Personal Pronouns)", "பொருள் பிரதிபெயர்கள்(Subject Pronouns)", "பொருள் பிரதிபெயர்கள்(Object Pronouns)", "பரஸ்பர பிரதிபெயர்கள்(Reciprocal Pronouns)", "தீவிர பிரதிபெயர்கள்(Intensive Pronouns)"], "Types Explaination": {"Relative Pronouns": "உறவினர் பிரதிபெயர் என்பது ஒரு சார்புடைய உட்பிரிவுடன் ஒரு சுயாதீன உட்பிரிவை இணைக்கப் பயன்படும் ஒரு சொல். உறவினர் பிரதிபெயர்கள் என்பது அது தொடர்புடைய பொருள் (பெயர்ச்சொல் அல்லது பிரதிபெயர்) பற்றிய கூடுதல் தகவல்களை வழங்குவதாகும். இந்த தொடர்புடைய பிரதிபெயர்கள் உரிச்சொற்களைப் போலவே செயல்படுகின்றன, எனவே அவை உருவாக்கும் உட்பிரிவுகளை பெயரடை உட்பிரிவுகள் என்றும் அழைக்கலாம்.", "Possessive Pronouns": "உடைமை பிரதிபெயர்கள் என்பது உங்கள் உடைமை அல்லது யாரோ அல்லது ஏதோவொன்றின் உரிமையைக் காட்டப் பயன்படுத்தப்படும் பிரதிபெயர்கள். அவை அந்த குறிப்பிட்ட நபருக்கு சொந்தமானவை என்றும் வேறு யாருக்கும் இல்லை என்றும் குறிப்பிடுகின்றன. மீண்டும் மீண்டும் வருவதைத் தவிர்க்க, பெயர்ச்சொல் சொற்றொடருக்குப் பதிலாக உடைமை பிரதிபெயர்களைப் பயன்படுத்தலாம்", "Reflexive Pronouns": "‘பிரதிபலிப்பு’ என்ற சொல்லுக்கு சுயத்தை நோக்கிய ஒன்று என்று பொருள். ஒரு பிரதிபலிப்பு பிரதிபெயர், எனவே, அதையே செய்யும் என்று எதிர்பார்க்கப்படுகிறது. இது பிரதிபெயரில் மீண்டும் பிரதிபலிக்கிறது. இது ஒரு வாக்கியத்தில் ஒரு பொருள் பிரதிபெயர் மற்றும் ஒரு பொருள் பிரதிபெயரின் இடத்தைப் பெறுகிறது.", "Demonstrative Pronouns": "டெமோ என்ற வார்த்தை அனைவருக்கும் தெரிந்திருக்கும். டெமோ என்ற சொல் பொதுவாக ஆர்ப்பாட்டத்தின் சுருக்கமாகப் பயன்படுத்தப்படுகிறது. ஆர்ப்பாட்டம் என்பது ஒருவருக்கு எதையாவது குறிப்பிடுவது, அடையாளம் காண்பது, சுட்டிக்காட்டுவது, காட்சிப்படுத்துவது அல்லது விளக்குவது. அதையே செய்ய ஒரு ஆர்ப்பாட்ட பிரதிபெயர் பயன்படுத்தப்படுகிறது. இது ஒரு வாக்கியத்தில் பொருள் அல்லது பொருளாக செயல்படும் பெயர்ச்சொற்களை நிரூபிக்கிறது அல்லது பிரதிபலிக்கிறது", "Interrogative Pronouns": "கேள்விகளைக் கேட்க, பெயர் குறிப்பிடுவது போல, ஒரு கேள்விக்குரிய பிரதிபெயர் பயன்படுத்தப்படுகிறது. இது எதையாவது அல்லது யாரையாவது குறிக்கிறது. என்ன, எது, யார், யாருடையது மற்றும் ஆங்கில மொழியில் ஐந்து கேள்விக்குரிய பிரதிபெயர்கள்.", "Indefinite Pronouns": "காலவரையற்ற பிரதிபெயர்கள் என்பது எந்தவொரு குறிப்பிட்ட நபர், இடம் அல்லது பொருளைக் குறிக்காத பிரதிபெயர்கள். காலவரையற்ற பிரதிபெயர்களின் சில எடுத்துக்காட்டுகள் யாரோ, யாரோ, எங்கோ, ஏதோ, யாரோ, யாரோ, எங்கும், எதையும், யாரும், யாரும், எங்கும், எல்லோரும், எல்லோரும், எல்லா இடங்களிலும், எல்லாம், ஒவ்வொன்றும், இல்லை, சில, மற்றும் பல", "Personal Pronouns": "தனிப்பட்ட பிரதிபெயர்கள் ஒரு குறிப்பிட்ட சூழலில் மீண்டும் மீண்டும் வரும் சரியான பெயர்ச்சொற்களை மாற்றியமைக்கப் பயன்படுத்தப்படும் ஒருமொழிச் சொற்கள். தனிப்பட்ட பிரதிபெயர் தொடர்புடைய பெயர்ச்சொல்லின் எண் மற்றும் பாலினத்தைக் குறிக்கிறது", "Subject Pronouns": "பொருள் பிரதிபெயர் என்பது பெயர்ச்சொல்லின் இடத்தில் பயன்படுத்தப்படும் ஒரு சொல். இது வாக்கியத்தில் ஒரு பொருளின் பாத்திரத்தை வகிக்கிறது. பொருள் பிரதிபெயர்கள் வழக்கமாக ஒரு வாக்கியத்தின் முதல் பகுதியில், வினைச்சொல்லுக்கு சற்று முன், செயலைச் செய்பவரைக் குறிக்கும்.", "Object Pronouns": "ஒரு பொருள் பிரதிபெயர் என்பது ஒரு தனிப்பட்ட பிரதிபெயர் ஆகும், இது பொதுவாக இலக்கணப் பொருளாகப் பயன்படுத்தப்படுகிறது, இது ஒரு வினைச்சொல்லின் நேரடி அல்லது மறைமுக பொருளாக அல்லது ஒரு முன்மொழிவின் பொருளாகப் பயன்படுத்தப்படுகிறது. இந்த பிரதிபெயர்கள் எப்போதும் புறநிலை வழக்கை எடுத்துக்கொள்கின்றன, அவை மறைமுக பொருள் பிரதிபெயர்களாக இருந்தாலும் அல்லது நேரடி பொருள் பிரதிபெயர்களாக இருந்தாலும் சரி", "Reciprocal Pronouns": "ஒரு பரஸ்பர பிரதிபெயர் என்பது இரண்டு அல்லது அதற்கு மேற்பட்ட நபர்கள் சில வகையான செயலைச் செய்கிறார்கள் அல்லது செய்திருக்கிறார்கள் என்பதைக் குறிக்கப் பயன்படும் ஒரு பிரதிபெயர் ஆகும், அந்த செயலின் நன்மைகள் அல்லது விளைவுகளை இருவரும் ஒரே நேரத்தில் பெறுகிறார்கள். எந்த நேரத்திலும் ஏதாவது செய்யும்போது அல்லது அதற்குப் பதிலாக கொடுக்கப்பட்டால், பரஸ்பர பிரதிபெயர்கள் பயன்படுத்தப்படுகின்றன. பரஸ்பர நடவடிக்கை வெளிப்படுத்தப்படும் எந்த நேரத்திலும் இதுவே உண்மை", "Intensive Pronouns": "ஒரு தீவிர பிரதிபெயர் ஒரு பிரதிபலிப்பு பிரதிபெயரை மிகவும் ஒத்திருக்கிறது, இது பெரும்பாலும் அனைத்து இரண்டாம் மொழி கற்பவர்களையும் குழப்புகிறது. ஒவ்வொரு பிரதிபெயர்களும் எவ்வாறு வித்தியாசமாக செயல்படுகின்றன என்பதை நீங்கள் புரிந்து கொண்டால் அது மிகவும் எளிதாகிவிடும். தீவிர பிரதிபெயர் என்பது ஒரு வாக்கியத்தில் பொருள் செய்யும் செயலுக்கு முக்கியத்துவம் அளிக்கப் பயன்படும் பிரதிபெயர்"}, "example": {"Relative Pronouns": ["ஆசிரியையான ஷீலா, சமூக சேவகராகவும் பணியாற்றி வருகிறார்.", "கடந்த மாதம் திருடப்பட்ட கார் ஆற்றில் கண்டெடுக்கப்பட்டது.", "நான் சொன்ன பெண் சூசன்"], "Possessive Pronouns": ["பாபி என்னுடைய சகோதரர்.", "அந்தச் சிறுமி என் மகள், இவள் அவளுடையவள்", "கடந்த வாரம் டயானா சுட்ட கேக் உங்களுடையது போல் இல்லை"], "Reflexive Pronouns": ["அவர்கள் தங்களைப் பார்த்தார்கள்.", "கார் ஓட்டக் கற்றுக்கொண்டேன்", "டீனா மற்றும் டைசன் ஆகியோர் உதாரணம் 4 இல் உள்ளவர்கள், அவர்கள் தங்களைத் தயார்படுத்திக் கொள்கிறார்கள், வேறு யாரும் இல்லை"], "Demonstrative Pronouns": ["நான் தேடிய புத்தகம் இது", "அத்தனை பணமும் கொண்ட பெட்டி அது", "இவற்றின் விலை நான் எதிர்பார்த்ததை விட மிகவும் குறைவு."], "Interrogative Pronouns": ["இது என்னுடையது", "நான் திருமதி கிளாரிடம் பேசினேன்.", "நிக் முக்கிய பேச்சாளராக இருந்தார்"], "Indefinite Pronouns": ["ப்ரீட்ஸலை விரும்புபவர்கள் யாராவது இருக்கிறார்களா?", "அவர்களில் இன்னொருவர் வீட்டிற்குள் நுழைந்தார்", "ஆசிரியர் ஒவ்வொருவரும் தங்கள் திட்டங்களை முன்வைக்கச் சொன்னார்கள்"], "Personal Pronouns": ["நீங்கள் கொலம்பியாவைச் சேர்ந்தவர், இல்லையா?", "உங்கள் பணிகளைச் செய்தீர்களா?", "iroz, ஜென்னியும் நானும் நேற்று இரவு ஒரு திரைப்படம் பார்க்கச் சென்றோம்"], "Subject Pronouns": ["நான் தினமும் பள்ளிக்கு செல்கிறேன்.", "நாங்கள் அடுத்த வாரம் பாரிஸுக்கு பயணம் செய்கிறோம்", "அவர் நாளை நினாவை சந்திக்கிறார்"], "Object Pronouns": ["பாரி வாங்கினார்.", "ஜெசிகாவும் லோரெய்னும் மாலையில் அவளை சந்தித்தனர்", "உங்களுக்கு பிடித்ததா?"], "Reciprocal Pronouns": ["ரேச்சலும் ரோஸும் ஒருவரையொருவர் நேசிக்கிறார்கள்.", "என் சகோதரனும் என் உறவினரும் ஒருவரையொருவர் குற்றம் சாட்டிக் கொண்டனர்"], "Intensive Pronouns": ["நானே அதைச் செய்யவில்லை.", "லாசக்னா முழுவதையும் நீங்களே முடித்துவிட்டீர்களா?", "அவனே தன் கதவை உடைத்துக் கொள்வான் என்பதை யாராலும் நம்ப முடியவில்லை"]}}, "Adjective": {"definition": "பெயரடை என்பது பேச்சின் ஒரு பகுதியாகும், இது ஒரு வாக்கியத்தில் பொருளாக செயல்படும் பெயர்ச்சொல் அல்லது பிரதிபெயரைப் பற்றிய கூடுதல் தகவல்களை விவரிக்க அல்லது வழங்க பயன்படுகிறது. உரிச்சொற்கள் வினைச்சொல்லுக்குப் பிறகு அல்லது அது மாற்றியமைக்கும் பெயர்ச்சொல்லுக்கு முன் காணப்படுகின்றன", "Types": ["உடைமை உரிச்சொற்கள்(Possessive Adjectives)", "கேள்விக்குரிய உரிச்சொற்கள்(Interrogative Adjectives)", "ஆர்ப்பாட்ட உரிச்சொற்கள்(Demonstrative Adjectives)", "கூட்டு உரிச்சொற்கள்(Compound Adjectives)"], "Types Explaination": {"Possessive Adjectives": "காலின்ஸ் அகராதியின்படி, ஒரு உடைமைப் பெயரடை, \"என்னுடையது' அல்லது 'உங்கள்' போன்ற பெயரடை, இது யாருடையது அல்லது எதைச் சார்ந்தது அல்லது தொடர்புடையது என்பதைக் காட்டுகிறது. மெரியம்-வெப்ஸ்டர் அகராதியின்படி, உடைமை உரிச்சொல் என்பது \"உடைமையை வெளிப்படுத்தும் ஒரு பெயரடை பெயரடையாகும்.", "Interrogative Adjectives": "கேள்வியைக் கேட்டு பெயர்ச்சொல் அல்லது பிரதிபெயரை மாற்றியமைக்கப் பயன்படுத்தப்படும் ஒரு பெயர்ச்சொல் கேள்விக்குரிய பெயரடை எனப்படும். வினவு உரிச்சொற்கள் என்று சொல்லக்கூடிய சில உரிச்சொற்கள் மட்டுமே உள்ளன. அவை யாருடையது, எது, எது.", "Demonstrative Adjectives": "பெயர் குறிப்பிடுவது போல, ஒரு ஆர்ப்பாட்ட உரிச்சொல் என்பது ஒருவரின் அல்லது ஏதோவொன்றின் நிலையை குறிப்பாக விவரிக்கப் பயன்படும் பெயரடை.", "Compound Adjectives": "கூட்டு உரிச்சொற்கள் இரண்டு அல்லது அதற்கு மேற்பட்ட உரிச்சொற்களைக் கொண்டிருக்கின்றன, அவை ஒன்றாக இணைக்கப்பட்டு, பொருளை மாற்றுவதற்குப் பயன்படுத்தக்கூடிய ஒரு பெயரடையை உருவாக்குகின்றன. கூட்டு உரிச்சொற்களின் சில எடுத்துக்காட்டுகள் பருத்தி-வால், சுருள்-ஹேர்டு, மனம் இல்லாத, மகிழ்ச்சியான-அதிர்ஷ்டம் போன்றவை"}, "example": {"Possessive Adjectives": ["ராம் என் சகோதரர்", "உங்கள் மகனை சென்னையில் சந்தித்ததாக மிக்கி என்னிடம் கூறினார்", "தயவுசெய்து எனது தண்ணீர் பாட்டிலை நிரப்ப முடியுமா?"], "Interrogative Adjectives": ["அந்த சாவி யாருடையது என்று கண்டுபிடித்தீர்களா?", "8 ஆம் வகுப்பு மாணவர்களுக்கு என்ன வகையான புத்தகங்களை பரிந்துரைக்கிறீர்கள்?", "பயணத்திற்கு எங்களுடன் எந்த ஆசிரியர் வருவார் என்று உங்களுக்கு ஏதேனும் யோசனை இருக்கிறதா?"], "Demonstrative Adjectives": ["இந்த மருத்துவமனைதான் நான் பிறந்த இடம்.", "இந்த நேரத்தில் உங்களுக்கு கடன் கொடுக்கும் சூழ்நிலையில் நான் இல்லை", "இந்த ஓட்டலின் சூழல் இனிமையானது"], "Compound Adjectives": ["உங்களுக்கு ஒயிட் காலர் வேலை இருக்கிறதா?", "ஜோஷ்வா இன்று தனது புத்தம் புதிய ஆடி காரில் கல்லூரிக்கு வந்துள்ளார்", "இந்த அழகுசாதனப் பொருட்கள் அனைத்தும் கொடுமையற்றவை மற்றும் மலிவு விலையில் உள்ளன"]}}, "Preposition": {"definition": "முன்மொழிவு என்பது ஒரு குறுகிய வார்த்தையாகும், இது அந்தந்த வாக்கியங்களுக்குள் உள்ள பிற பகுதிகளுடன் உள்ள உறவு பெயர்ச்சொற்கள், பிரதிபெயர்கள் அல்லது சொற்றொடர்களைக் காட்ட வாக்கியங்களில் பயன்படுத்தப்படுகிறது. முன்மொழிவுகள் பொதுவாக வாக்கியத்தின் பிற்பகுதியில் அமைந்துள்ளன, ஆனால் பெயர்ச்சொல் அல்லது பிரதிபெயருக்கு முன்.", "Types": ["நேரத்தின் முன்மொழிவுகள்(Prepositions of Time)", "இடத்தின் முன்மொழிவுகள்(Prepositions of Place)", "திசையின் முன்மொழிவுகள்(Prepositions of Direction)", "இருப்பிடத்தின் முன்மொழிவுகள்(Prepositions of Location)", "முன்னிடை சொற்றொடர்(Prepositional Phrase )"], "Types Explaination": {"Prepositions of Time": "நேரத்தின் முன்மொழிவு என்பது ஒரு குறிப்பிட்ட செயல் எப்போது நிகழ்கிறது என்பதைக் குறிக்கப் பயன்படுத்தப்படும் ஒரு முன்மொழிவு ஆகும். நேரத்தின் மிகவும் பொதுவான முன்மொழிவுகள் அட், இன் மற்றும் ஆன் ஆகும்", "Prepositions of Place": "நேரத்தின் முன்மொழிவு என்பது ஒரு குறிப்பிட்ட செயல் எப்போது நிகழ்கிறது என்பதைக் குறிக்கப் பயன்படுத்தப்படும் ஒரு முன்மொழிவு ஆகும். நேரத்தின் மிகவும் பொதுவான முன்மொழிவுகள் அட், இன் மற்றும் ஆன் ஆகும்", "Prepositions of Direction": "திசையின் முன்மொழிவுகள் என்பது ஒரு நபர் அல்லது பொருளின் மற்றொரு நபர் அல்லது பொருளின் இயக்கம் அல்லது திசையைக் குறிக்கும் சொற்கள். ஒரு வாக்கியத்தில் வெவ்வேறு பொருள்கள் அல்லது இருப்பிடங்களுக்கு இடையிலான உறவைப் புரிந்துகொள்ள அவை நமக்கு உதவுகின்றன.", "Prepositions of Location": "இடஞ்சார்ந்த உறவுகளை வெளிப்படுத்தும் முன்மொழிவுகள் இரண்டு வகைகளாகும்: இருப்பிடத்தின் முன்மொழிவுகள் மற்றும் திசையின் முன்மொழிவுகள். இரண்டு வகைகளும் நேர்மறையாகவோ அல்லது எதிர்மறையாகவோ இருக்கலாம். இருப்பிடத்தின் முன்மொழிவுகள் நிலைகள் அல்லது நிபந்தனைகளை விவரிக்கும் வினைச்சொற்களுடன் தோன்றும், குறிப்பாக இருக்க வேண்டும்; திசையின் முன்மொழிவுகள் இயக்கத்தின் வினைச்சொற்களுடன் தோன்றும். இந்த கையேடு சில நேரங்களில் சிரமத்தை ஏற்படுத்தும் இடத்தின் நேர்மறையான முன்மொழிவுகளைக் கையாள்கிறது: at, on மற்றும் in.", "Prepositions of Spatial Relationship": "இடஞ்சார்ந்த உறவுகளின் முன்மொழிவுகள் மற்றொரு பொருள் அல்லது நபருடன் தொடர்புடைய ஒரு பொருள் அல்லது நபரின் நிலை அல்லது இருப்பிடத்தை விவரிக்கும் சொற்கள். அவை இடஞ்சார்ந்த ஏற்பாடு அல்லது பொருட்களின் இடம் பற்றிய தகவல்களை வழங்க உதவுகின்றன. இடஞ்சார்ந்த உறவுகளின் சில பொதுவான முன்மொழிவுகள் இங்கே உள்ளன", "Prepositional Phrase": "ஒரு முன்மொழிவு சொற்றொடர் என்பது ஒரு முன்மொழிவு, ஒரு மாற்றி மற்றும் அதன் பொருள் ஆகியவற்றின் கலவையாகும். குறிப்பிட்ட வாக்கியத்தில் அதன் பங்கின் அடிப்படையில் ஒரு வாக்கியத்தின் தொடக்கத்தில், நடுவில் அல்லது முடிவில் ஒரு முன்மொழிவு சொற்றொடர் வைக்கப்படலாம். முன்மொழிவு சொற்றொடர்கள் அது மாற்றியமைக்கும் வாக்கியத்தின் ஒரு பகுதியாகும் மற்றும் தனியாக நிற்க முடியாது."}, "example": {"Prepositions of Time": ["கூட்டம் காலை 10.00 மணிக்கு.", "நான் 1980களில் பிறந்தேன்.", "எனது பிறந்த நாள் செவ்வாய் கிழமை."], "Prepositions of Place": ["பூனை வாசலில் உள்ளது.", "புத்தகம் பெட்டியில் உள்ளது.", "கோப்பை மேஜையில் உள்ளது"], "Prepositions of Direction": ["நாய் பந்துக்கு ஓடியது.", "பூனை மரத்திலிருந்து குதித்தது.", "பந்து மலையிலிருந்து கீழே விழுந்தது."], "Prepositions of Location": ["பூனை வாசலில் உள்ளது.", "புத்தகம் பெட்டியில் உள்ளது.", "கோப்பை மேஜையில் உள்ளது"], "Prepositions of Spatial Relationship": ["பறவை மரங்களுக்கு மேலே பறக்கிறது.", "பூனை தெரு முழுவதும் நடந்து சென்றது.", "நாற்காலி சுவரில் சாய்ந்துள்ளது"], "Prepositional Phrase": ["\"பூங்காவில்\": \"இன்\" என்ற முன்னுரையானது \"பூங்கா\" என்ற பொருளுக்கும் இருப்பிடத்திற்கும் இடையிலான உறவைக் காட்டுகிறது. இது \"எங்கே?\" என்ற கேள்விக்கு பதிலளிக்கும் ஒரு வினையுரிச்சொல்லாக செயல்படுகிறது.\",\"\"புன்னகையுடன்\": \"உடன்\" என்ற முன்னுரையானது \"புன்னகை\" என்ற பொருளுக்கும் ஏதாவது செய்யப்படும் விதத்திற்கும் இடையே உள்ள தொடர்பைக் காட்டுகிறது. இது \"எப்படி?\" என்ற கேள்விக்கு பதிலளிக்கும் ஒரு வினையுரிச்சொல்லாக செயல்படுகிறது."]}}, "Conjunctions": {"definition": "வார்த்தைகள், சொற்றொடர்கள், உட்பிரிவுகள் அல்லது வாக்கியங்களை இணைக்கப் பயன்படும் பேச்சின் ஒரு பகுதி இணைப்பு. இணைப்புகள் மாறாத இலக்கணத் துகள்களாகக் கருதப்படுகின்றன, மேலும் அவை ஒன்றிணைக்கும் பொருட்களுக்கு இடையில் நிற்கலாம் அல்லது இல்லாமல் இருக்கலாம்.", "Types": ["ஒருங்கிணைப்பு இணைப்புகள்(Coordinating Conjunctions)", "சார்ந்த இணைப்புச்சொற்கள்(Subordinating Conjunctions)", "ஒப்புமை இணைப்புச்சொற்கள்(Correlative Conjunctions)", "இணைப்பு வினையெச்சங்கள்(Conjunctive Adverbs)"], "Types Explaination": {"Coordinating Conjunctions": "ஒரே தொடரியல் முக்கியத்துவம் வாய்ந்த இரண்டு அல்லது அதற்கு மேற்பட்ட வாக்கியங்கள், முக்கிய உட்பிரிவுகள், வார்த்தைகள் அல்லது பேச்சின் பிற பகுதிகளை ஒருங்கிணைத்தல் அல்லது இணைத்தல். ஒருங்கிணைப்பாளர்கள் என்றும் அழைக்கப்படும், ஒரு ஜோடி முக்கிய உட்பிரிவுகளுக்கு சமமான முக்கியத்துவம் கொடுக்க ஒருங்கிணைப்பு இணைப்புகள் பயன்படுத்தப்படுகின்றன", "Subordinating Conjunctions": "Subordinating conjunctions are parts of speech that join dependent clauses to independent clauses. Sometimes referred to as subordinators or subordinate conjunctions, these important words and phrases may also introduce adverb clauses", "Correlative Conjunctions": "ஒரு வாக்கியத்திற்குள் சமமான முக்கியத்துவத்தைக் கொண்ட சொற்றொடர்கள் அல்லது சொற்களை இணைக்க ஜோடிகளாக வேலை செய்யும் தொடர்பு இணைப்புகள் ஒன்றோடொன்று தொடர்புடையவை. பேச்சின் பல சுவாரஸ்யமான பகுதிகளைப் போலவே, தொடர்பு இணைப்புகளும் பயன்படுத்த வேடிக்கையாக இருக்கும். அதே நேரத்தில், அவற்றை சரியாகப் பயன்படுத்துவதற்கு சில முக்கியமான விதிகள் உள்ளன", "Conjunctive Adverbs": "இணைந்த வினையுரிச்சொற்கள் என்பது ஒரு உட்பிரிவை மற்றொன்றுடன் இணைக்கப் பயன்படும் பேச்சின் பகுதிகள். அவை வரிசை, மாறுபாடு, காரணம் மற்றும் விளைவு மற்றும் பிற உறவுகளைக் காட்டவும் பயன்படுத்தப்படுகின்றன"}, "example": {"Coordinating Conjunctions": ["நான் உரொட்டியும் வெண்ணையும் விரும்புகிறேன்", "நான் தேனீர் விரும்புகிறேன், ஆனால் நான் காப்பி(க்கு) விருப்பமில்லை", "எப்படி ஆங்கிலம் பேசுவது (என்பதும்) எப்படி ஆங்கிலத்தில் எழுதுவது (என்பதும்) இரண்டு வெவ்வேறு விடயங்கள்."], "Subordinating Conjunctions": ["நான் ஒரு வேலை செய்தால் எனக்கு கிடைக்கும் அனுபவம்.", "எனக்கு கிடைக்கும் அனுபவம் நான் செய்தால் ஒரு வேலை", "அவன் சிறியவனாக இருந்தப்போதிலும், அவன் மிகவும் வலுவானவன்"], "Correlative Conjunctions": ["பூனைகள் நாய்கள் இரண்டுமே எனது விருப்பு மிருகங்கள் அல்ல.", "இன்று சூடாக மட்டுமல்ல ஈரப்பதமாகவும் கூட உள்ளது.", "கணனி மற்றும்  ஐபேட் இரண்டும் எனக்கு வேண்டும்"], "Conjunctive Adverbs": ["எனக்கு ஒரு சட்டை வாங்க வேண்டும்; எனினும், அதன் விலை மிகவும் அதிகமாக இருந்தது.", "டேவிட் சந்தைக்கு சென்றார்; இருப்பினும், அவர் எதனையும் வாங்கவில்லை.", "சர்மிலன் களைப்பாக இருந்தான். அதனால், அவன் வீட்டிற்கு சென்றடைந்தவுடன் ஒரு சிறுநித்திரை (கொண்டான்) எடுத்தான்."]}}, "interjection": {"definition": "இடைச்சொல் என்பது வழக்கமான பேச்சில் செருகப்பட்ட ஒரு வகையான ஆச்சரியம். உண்மையில், இது உணர்ச்சிகளை வெளிப்படுத்தும் பேச்சில் ஒரு சுருக்கமான மற்றும் திடீர் இடைநிறுத்தம்", "Types": ["முதன்மை இடைச்சொல்(Primary Interjection)", "இரண்டாம் நிலை இடைச்சொல்(Secondary Interjection)", "லேசான இடைச்சொல்(Mild Interjection)", "வலுவான இடைச்சொல்(Strong Interjection)", "வோலிடிவ் இடைச்செருகல்(Volitive Interjection)", "உணர்ச்சி இடைச்செருகல்(Emotive Interjection)", "அறிவாற்றல் இடைச்செருகல்(Cognitive Interjection )"], "Types Explaination": {"Primary Interjection": "பிரத்தியேகமாக இடைச்செருகல்களாக இருக்கும் மற்றும் பேச்சின் வேறு எந்தப் பகுதிகளாகவும் வகைப்படுத்த முடியாத சொற்கள் முதன்மை இடைச்சொற்கள் என்று அழைக்கப்படுகின்றன.", "Secondary Interjection": "பெயர்ச்சொற்கள், உரிச்சொற்கள் மற்றும் சந்தர்ப்பங்களில் இடைச்செருகல்களாக செயல்படும் பேச்சின் பிற பகுதிகள் இரண்டாம் நிலை இடைச்சொற்கள் எனப்படும்", "Mild Interjection": "உணர்வுகள் மற்றும் உணர்ச்சிகளின் ஒப்பீட்டளவில் லேசான வெளிப்பாடு பொதுவாக லேசான இடைச்செருகல்கள் என்று அழைக்கப்படுகிறது. இந்த வகைகள் பொதுவாக மற்ற வாக்கியங்களிலிருந்து காற்புள்ளிகளால் பிரிக்கப்படுகின்றன", "Strong Interjection": "The strong outbursts of expression are determined as Strong Interjections. These types are typically separated from the rest of the sentence by exclamation marks", "Volitive Interjection": "கட்டளைகள், கோரிக்கைகள் மற்றும் விருப்பங்கள் பொதுவாக Volitive Interjections மூலம் வெளிப்படுத்தப்படுகின்றன. பேச்சில், \"எனக்கு வேண்டும்\" வெளிப்பாடுகள் Volitive Interjections மூலம் மாற்றப்படுகின்றன.\"போதும்\" என்பது யாரோ ஒருவர் சொல்வதைக் கேட்பதை நிறுத்த விரும்புவதை வெளிப்படுத்துகிறது மற்றும் ஒரு போட்டி அறிக்கையை முன்வைக்கலாம். \"ஷூ\" என்பது பேச்சாளரின் விருப்பத்தை வெளிப்படுத்தும் ஒருவரை விரட்டுகிறது.", "Emotive Interjection": "ஆச்சரியம், மகிழ்ச்சி, துக்கம், வெறுப்பு மற்றும் பயம் போன்ற உணர்ச்சிகளின் திடீர் தூண்டுதலை வெளிப்படுத்தும் வார்த்தைகள் உணர்ச்சி இடைச்செருகல்களாகும். இந்த வகைகள் பொதுவாக பேச்சில் \"நான் உணர்கிறேன்\" வெளிப்பாடுகளை மாற்றும். \"Eww\" என்றால் தெரிவிப்பது - \"நான் வெறுப்பாக உணர்கிறேன்\" மற்றும் \"Phew\" என்றால் வெளிப்படுத்துவது - \"நான் நிம்மதியாக உணர்கிறேன்", "Cognitive Interjection": "அறிவாற்றலில் இருந்து பிறந்து ஆச்சரியக்குறிகளாகப் பயன்படுத்தப்படும் சொற்கள் அறிவாற்றல் இடைச்செருகல்கள் எனப்படும். அனுபவத்தின் மூலம் மக்கள் சந்திக்கும் மற்றும் புரிந்துகொள்ளும் உணர்வுகள் மற்றும் உணர்ச்சிகளை வெளிப்படுத்த இந்த வகைகள் பயன்படுத்தப்படுகின்றன."}, "example": {"Primary Interjection": ["அச்சச்சோ, மோசம்", "ஆஹா! எங்களுடன் சேர உங்களுக்கு நேரம் கிடைத்தது.", "ஐயோ! என்னால் சரியான நேரத்தில் அங்கு இருக்க முடியவில்லை."], "Secondary Interjection": ["உண்மையாகவே, உங்கள் முன்னறிவிப்புகளுக்காக நான் காத்திருந்தேன்.", "நன்மை! இந்த புத்தகங்களை ஒரு நாளில் எப்படிப் படித்தீர்கள்?", "புனித பசு! நான் எதிர்பார்த்த கடைசி நபர் நீங்கள்தான்"], "Mild Interjection": ["ஓ, நான் உன்னைத் தேடிக்கொண்டிருந்தேன்.", "சரி, அது மிகவும் எளிதானது அல்ல", "ம்ம், நான் நன்றாக இருக்கிறேன்"], "Strong Interjection": ["ஆம்! நான் இறுதியாக தேர்ச்சி பெற்றேன்.", "பிங்கோ! அது கண்டுபிடிக்கப்பட்டது.", "ஐயோ! அது வலித்தது"], "Volitive Interjection": ["ஷ்ஷ் (நீங்கள் அமைதியாக இருக்க வேண்டும் என்று நான் விரும்புகிறேன்) - ஷ்ஷ்! நாம் அமைதியாக இருக்க வேண்டும்.", "அஹம் (உங்கள் கவனத்தை நான் கேட்டுக்கொள்கிறேன்) - ஆஹேம்! நான் இன்னொரு சிக்கலைப் பார்த்துக்கொண்டிருந்தேன்.", "Psst (நான் ரகசியமாக கவனத்தை ஈர்க்க விரும்புகிறேன்) - Psst! நான் ஒர்க் அவுட் செய்ய ஆரம்பித்துவிட்டேன்"], "Emotive Interjection": ["அச்சச்சோ (நான் வெறுப்பாக உணர்கிறேன்) - அச்சச்சோ! அது என்ன அசுத்தமான வாசனை?", "ஐயோ (எனக்கு வலிக்கிறது) - ஐயோ! இந்த எறும்புகள் கொட்டுகின்றன.", "Yippee (நான் உற்சாகமாக உணர்கிறேன்) - Yippee! ஆண்டை வெற்றியுடன் முடித்தோம்"], "Cognitive Interjection": ["சரி, நான் கடினமாக முயற்சி செய்கிறேன்", "பிராவோ! என்ன ஒரு நடிப்பு!", "அடடா, நீ மிக வேகமாக இருக்கிறாய்"]}}}